Hi,

I assume your snippet is part of a Terraform configuration which uses https://registry.terraform.io/providers/hashicorp/helm/latest/docs/resources/release? 

After some experimenting and googling, I've found https://github.com/hashicorp/terraform-provider-helm/issues/838#issuecomment-1204578168. As discussed in that comment, explicitly specifying `type = "string"` for the 2nd `set` block allows `terraform apply` to succeed for me.

Test config:

```terraform
# main.tf
terraform {
  required_providers {
    helm = {
      source = "hashicorp/helm"
      version = "2.9.0"
    }
  }
}

provider "helm" {
  # Configuration options
}

resource "helm_release" "signalilo" {
  name       = "signalilo"
  repository = "https://charts.appuio.ch"
  chart      = "signalilo"

  values = [
    "${file("values.yaml")}"
  ]

  set {
    name  = "extraEnvVars[0].name"
    value = "SIGNALILO_ICINGA_INSECURE_TLS"
  }
  set {
    name  = "extraEnvVars[0].value"
    value = "true"
    type  = "string"
  }
}
```

```yaml
# values.yaml
config:
  uuid: 9ec06d59-aa0c-4434-b5e2-1aeaf93cd925
  icinga_hostname: signalilo_signalilo_test
  icinga_url: https://<redacted>:5665
  icinga_username: signalilo_signalilo_test
  icinga_password: <redacted>
  alertmanager_bearer_token: aaaaaa
```

Terraform output (Terraform v1.4.2, deploying to K8s 1.25.2/kind 0.16.0):

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.signalilo will be created
  + resource "helm_release" "signalilo" {
      + atomic                     = false
      + chart                      = "signalilo"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "signalilo"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.appuio.ch"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                config:
                  uuid: 9ec06d59-aa0c-4434-b5e2-1aeaf93cd925
                  icinga_hostname: signalilo_signalilo_test
                  icinga_url: https:/<redacted>:5665
                  icinga_username: signalilo_signalilo_test
                  icinga_password: <redacted>
                  alertmanager_bearer_token: aaaaaa
            EOT,
        ]
      + verify                     = false
      + version                    = "0.12.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "extraEnvVars[0].name"
          + value = "SIGNALILO_ICINGA_INSECURE_TLS"
        }
      + set {
          + name  = "extraEnvVars[0].value"
          + type  = "string"
          + value = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

helm_release.signalilo: Creating...
helm_release.signalilo: Creation complete after 5s [id=signalilo]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```